[{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c1"
  },
  "password": "$2b$10$/KT/d2x3INI3/E5OYYr9xO9HR9T1/z9ct3K6FKNw/0Bvw3g/n7nJ6",
  "username": "yahya",
  "email": "machatyahya@gmail.com",
  "date_joined": {
    "$date": "2020-11-15T15:31:41.571Z"
  },
  "confirmed": false,
  "age": 27,
  "country": "Tunisia",
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": true
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c2"
  },
  "password": "$2b$10$8HQvxEfWPIw1PdJHi0ZkaeuQ8aC3DhSL.Ku/PupEwRLSMxHLk0/gS",
  "username": "luffy",
  "email": "luffy@gmail.com",
  "date_joined": {
    "$date": "2020-11-16T21:08:31Z"
  },
  "age": 20,
  "country": "Japan",
  "confirmed": true,
  "ordered_books": [
    {
      "_id": "601e81b9cc45272a0875c6d6",
      "name": "Cracking the Coding Interview: 189 Programming Questions and Solutions",
      "author": "Gayle Laakmann McDowell",
      "genre": "Computer Science",
      "publisher": "CareerCup, LLC",
      "date": "February 10th 2016",
      "summary": "Cracking the Coding Interview: 189 Programming Questions and Solutions is a book by Gayle Laakmann McDowell about coding interviews.[1][2] It describes typical problems in computer science that are often asked during coding interviews, typically on a whiteboard during job interviews at big technology companies such as Google, Apple, Microsoft, Amazon.com, Facebook and Palantir Technologies.",
      "about_author": "Gayle Laakmann McDowell is the founder / CEO of CareerCup, and the author of Cracking the PM Interview, Cracking the Coding Interview, and Cracking the Tech Career.\r\n\r\nGayle has worked for Microsoft, Apple and Google as a software engineer. She holds a bachelor's and master's degree from the University of Pennsylvania in Computer Science, and an MBA from the Wharton School. She currently resides in Palo Alto, CA.",
      "rate": 8.7,
      "price": 12,
      "image": "Cracking_the_Coding_Interview_189_Programming_Questions_and_Solutions.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6d4",
      "name": "Antifragile: Things That Gain from Disorder",
      "author": "Nassim Nicholas Taleb",
      "genre": "Psychology",
      "publisher": "Random House",
      "date": "November 27th 2012",
      "summary": "From the bestselling author of The Black Swan and one of the foremost philosophers of our time, Nassim Nicholas Taleb, a book on how some systems actually benefit from disorder.\r\n\r\nIn The Black Swan Taleb outlined a problem; in Antifragile he offers a definitive solution: how to gain from disorder and chaos while being protected from fragilities and adverse events. For what he calls the \"antifragile\" is one step beyond robust, as it benefits from adversity, uncertainty and stressors, just as human bones get stronger when subjected to stress and tension.\r\n\r\nTaleb stands uncertainty on its head, making it desirable, and proposing that things be built in an antifragile manner. Extremely ambitious and multidisciplinary, Antifragile provides a blueprint for how to behave-and thrive-in a world we don't understand and which is too uncertain for us to even try to understand. He who is not antifragile will perish. Why is the city state better than the nation state, why is debt bad for you, and why is almost everything modern bound to fail? The book covers innovation, health, biology, medicine, life decisions, politics, foreign policy, urban planning, war, personal finance, and economic systems. Throughout, the voice and recipes of the ancient wisdom from Phoenician, Roman, Greek, and Medieval sources are heard loud and clear.",
      "about_author": "Nassim Nicholas Taleb spent 21 years as a risk taker (quantitative trader) before becoming a flaneur and researcher in philosophical, mathematical and (mostly) practical problems with probability. \r\n\r\nTaleb is the author of a multivolume essay, the Incerto (The Black Swan, Fooled by Randomness, Antifragile, and Skin in the Game) an investigation of opacity, luck, uncertainty, probability, human error, risk, and decision making when we don’t understand the world, expressed in the form of a personal essay with autobiographical sections, stories, parables, and philosophical, historical, and scientic discussions in nonover lapping volumes that can be accessed in any order.\r\n\r\nIn addition to his trader life, Taleb has also written, as a backup of the Incerto, more than 50 scholarly papers in statistical physics, statistics, philosophy, ethics, economics, international affairs, and quantitative finance, all around the notion of risk and probability.\r\n\r\nTaleb is currently Distinguished Professor of Risk Engineering at NYU's Tandon School of Engineering (only a quarter time position). His current focus is on the properties of systems that can handle disorder (\"antifragile\").\r\n\r\nTaleb believes that prizes, honorary degrees, awards, and ceremonialism debase knowledge by turning it into a spectator sport.",
      "rate": 7.8,
      "price": 25,
      "image": "Antifragile_Things_That_Gain_from_Disorder.jpg"
    }
  ],
  "liked_books": [
    {
      "_id": "601e81b9cc45272a0875c6de",
      "name": "Attack on Titan",
      "author": "Hajime Isayama",
      "genre": "Manga",
      "publisher": "Kodansha Comics",
      "date": "June 19th 2012",
      "summary": "For the past century, what's left of mankind has hidden in a giant, three-walled city, trapped in fear of the bizarre, giant humanoids known as the Titans. Little is known about where they came from or why they are bent on consuming humankind, but the sudden appearance of an enormous Titan is about to change everything...",
      "about_author": "Hajime Isayama (諫山 創 Isayama Hajime, born 1986) is a Japanese manga artist from Ōyama, Ōita. His first and currently ongoing serial, Attack on Titan, has sold over 22 million copies as of July 2013. He has mentioned Tsutomu Nihei, Ryōji Minagawa, Kentaro Miura, Hideki Arai and Tōru Mitsumine as artists he respects, but stated that the manga that had the biggest influence on him was ARMS.",
      "rate": 9,
      "price": 10,
      "image": "Attack_on_Titan.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6d4",
      "name": "Antifragile: Things That Gain from Disorder",
      "author": "Nassim Nicholas Taleb",
      "genre": "Psychology",
      "publisher": "Random House",
      "date": "November 27th 2012",
      "summary": "From the bestselling author of The Black Swan and one of the foremost philosophers of our time, Nassim Nicholas Taleb, a book on how some systems actually benefit from disorder.\r\n\r\nIn The Black Swan Taleb outlined a problem; in Antifragile he offers a definitive solution: how to gain from disorder and chaos while being protected from fragilities and adverse events. For what he calls the \"antifragile\" is one step beyond robust, as it benefits from adversity, uncertainty and stressors, just as human bones get stronger when subjected to stress and tension.\r\n\r\nTaleb stands uncertainty on its head, making it desirable, and proposing that things be built in an antifragile manner. Extremely ambitious and multidisciplinary, Antifragile provides a blueprint for how to behave-and thrive-in a world we don't understand and which is too uncertain for us to even try to understand. He who is not antifragile will perish. Why is the city state better than the nation state, why is debt bad for you, and why is almost everything modern bound to fail? The book covers innovation, health, biology, medicine, life decisions, politics, foreign policy, urban planning, war, personal finance, and economic systems. Throughout, the voice and recipes of the ancient wisdom from Phoenician, Roman, Greek, and Medieval sources are heard loud and clear.",
      "about_author": "Nassim Nicholas Taleb spent 21 years as a risk taker (quantitative trader) before becoming a flaneur and researcher in philosophical, mathematical and (mostly) practical problems with probability. \r\n\r\nTaleb is the author of a multivolume essay, the Incerto (The Black Swan, Fooled by Randomness, Antifragile, and Skin in the Game) an investigation of opacity, luck, uncertainty, probability, human error, risk, and decision making when we don’t understand the world, expressed in the form of a personal essay with autobiographical sections, stories, parables, and philosophical, historical, and scientic discussions in nonover lapping volumes that can be accessed in any order.\r\n\r\nIn addition to his trader life, Taleb has also written, as a backup of the Incerto, more than 50 scholarly papers in statistical physics, statistics, philosophy, ethics, economics, international affairs, and quantitative finance, all around the notion of risk and probability.\r\n\r\nTaleb is currently Distinguished Professor of Risk Engineering at NYU's Tandon School of Engineering (only a quarter time position). His current focus is on the properties of systems that can handle disorder (\"antifragile\").\r\n\r\nTaleb believes that prizes, honorary degrees, awards, and ceremonialism debase knowledge by turning it into a spectator sport.",
      "rate": 7.8,
      "price": 25,
      "image": "Antifragile_Things_That_Gain_from_Disorder.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6d2",
      "name": "Confessions of an Economic Hitman",
      "author": "John Perkins",
      "genre": "Politics",
      "publisher": "Plume",
      "date": "2004",
      "summary": "John Perkins started and stopped writing Confessions of an Economic Hit Man four times over 20 years. He says he was threatened and bribed in an effort to kill the project, but after 9/11 he finally decided to go through with this expose of his former professional life. Perkins, a former chief economist at Boston strategic-consulting firm Chas. T. Main, says he was an \"economic hit man\" for 10 years, helping U.S. intelligence agencies and multinationals cajole and blackmail foreign leaders into serving U.S. foreign policy and awarding lucrative contracts to American business. \"Economic hit men (EHMs) are highly paid professionals who cheat countries around the globe out of trillions of dollars,\" Perkins writes. Confessions of an Economic Hit Man is an extraordinary and gripping tale of intrigue and dark machinations. Think John Le Carré, except it's a true story.\r\n\r\nPerkins writes that his economic projections cooked the books Enron-style to convince foreign governments to accept billions of dollars of loans from the World Bank and other institutions to build dams, airports, electric grids, and other infrastructure he knew they couldn't afford. The loans were given on condition that construction and engineering contracts went to U.S. companies. Often, the money would simply be transferred from one bank account in Washington, D.C., to another one in New York or San Francisco. The deals were smoothed over with bribes for foreign officials, but it was the taxpayers in the foreign countries who had to pay back the loans. When their governments couldn't do so, as was often the case, the U.S. or its henchmen at the World Bank or International Monetary Fund would step in and essentially place the country in trusteeship, dictating everything from its spending budget to security agreements and even its United Nations votes. It was, Perkins writes, a clever way for the U.S. to expand its \"empire\" at the expense of Third World citizens.",
      "about_author": "John Perkins is an activist and author. As a former chief economist at Boston strategic-consulting firm Chas. T. Main, Perkins says that he was an \"economic hit man\" for 10 years, helping U.S. intelligence agencies and multinational corporations cajole and blackmail foreign leaders into serving U.S. foreign policy and awarding lucrative contracts to American business.\r\n\r\nHowever, after several years struggling internally over the role he was playing in crippling foreign economies, he quit his consulting job. In the 1980s Perkins founded and directed a successful independent energy company, which he subsequently sold. Since then he has been heavily involved with non-profit organizations in Ecuador and around the world. He continues this work today, in addition to his writing. One of his organizations, Dream Change, is dedicated to shifting consciousness and promoting sustainable lifestyles for the individual and global community.\r\n\r\nHis new book, The New Confessions of an Economic Hit Man, a follow-up to best-seller Confessions of an Economic Hit Man, will be released in February 2016",
      "rate": 8.3,
      "price": 22,
      "image": "Confessions_of_an_Economic_Hitman.jpg"
    }
  ],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c3"
  },
  "password": "$2b$10$LT8N6FCUHXu952TT4MLgMun99wM3.Z2G133qPfi46AOM/ULiIir9q",
  "username": "zoro",
  "email": "zoro@gmail.com",
  "date_joined": {
    "$date": "2020-11-16T21:09:27Z"
  },
  "age": 30,
  "country": "Japan",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c4"
  },
  "password": "$2b$10$f.WmN1/HOxRYgVksxzh11OAWHdEk/0snPZ3hx0bEWHZpg7d1D1Q0i",
  "username": "sanji",
  "email": "sanji@gmail.com",
  "date_joined": {
    "$date": "2020-11-16T21:09:56Z"
  },
  "age": 25,
  "country": "Russia",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c5"
  },
  "password": "$2b$10$.kBrGMv07MD43WBuQlnBeurwUnRnRekqGEr.bSY30ipYnnxrDg1wq",
  "username": "ussop",
  "email": "ussop@gmail.com",
  "date_joined": {
    "$date": "2020-11-18T20:52:37Z"
  },
  "age": 22,
  "country": "Brazil",
  "confirmed": true,
  "ordered_books": [
    {
      "_id": "601e81b9cc45272a0875c6e1",
      "name": "Gintama",
      "author": "Hideaki Sorachi",
      "genre": "Manga",
      "publisher": "VIZ Media LLC",
      "date": "July 3rd 2007",
      "summary": "The samurai didn't stand a chance. First, the aliens invaded Japan. Next, they took all the jobs. And then they confiscated everyone's swords. So what does a hotheaded former samurai like Sakata \"Gin\" Gintoki do to make ends meet? Take any odd job that comes his way, even if it means losing his dignity.",
      "about_author": "Hideaki Sorachi (AKA 空知英秋 or Sorachi Hideaki) is a Japanese manga artist best known for his work Gintama.",
      "rate": 9.8,
      "price": 8,
      "image": "Gintama.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6e4",
      "name": "The Alchemist",
      "author": "Paulo Coelho",
      "genre": "Fiction",
      "publisher": "HarperOne",
      "date": "April 15th 2014",
      "summary": "Paulo Coelho's enchanting novel has inspired a devoted following around the world. This story, dazzling in its powerful simplicity and soul-stirring wisdom, is about an Andalusian shepherd boy named Santiago who travels from his homeland in Spain to the Egyptian desert in search of a treasure buried near the Pyramids. Along the way he meets a Gypsy woman, a man who calls himself king, and an alchemist, all of whom point Santiago in the direction of his quest. No one knows what the treasure is, or if Santiago will be able to surmount the obstacles in his path. But what starts out as a journey to find worldly goods turns into a discovery of the treasure found within. Lush, evocative, and deeply humane, the story of Santiago is an eternal testament to the transforming power of our dreams and the importance of listening to our hearts.",
      "about_author": "The Brazilian author PAULO COELHO was born in 1947 in the city of Rio de Janeiro. Before dedicating his life completely to literature, he worked as theatre director and actor, lyricist and journalist. In 1986, PAULO COELHO did the pilgrimage to Saint James of Compostella, an experience later to be documented in his book The Pilgrimage. In the following year, COELHO published The Alchemist. Slow initial sales convinced his first publisher to drop the novel, but it went on to become one of the best selling Brazilian books of all time. Other titles include Brida (1990), The Valkyries (1992), By the river Piedra I sat Down and Wept (1994), the collection of his best columns published in the Brazilian newspaper Folha de São Paulo entitle Maktub (1994), the compilation of texts Phrases (1995), The Fifth Mountain (1996), Manual of a Warrior of Light (1997), Veronika decides to die (1998), The Devil and Miss Prym (2000), the compilation of traditional tales in Stories for parents, children and grandchildren (2001), Eleven Minutes (2003), The Zahir (2005), The Witch of Portobello (2006) and Winner Stands Alone (to be released in 2009). During the months of March, April, May and June 2006, Paulo Coelho traveled to celebrate the 20th anniversary of his pilgrimage to Saint James of Compostella in 1986. He also held surprise book signings - announced one day in advance - in some cities along the way, to have a chance to meet his readers. In ninety days of pilgrimage the author traveled around the globe and took the famous Transiberrian train that took him to Vladivostok. During this experience Paulo Coelho launched his blog Walking the Path - The Pilgrimage in order to share with his readers his impressions. Since this first blog Paulo Coelho has expanded his presence in the internet with his daily blogs in Wordpress, Myspace & Facebook. He is equally present in media sharing sites such as Youtube and Flickr, offering on a regular basis not only texts but also videos and pictures to his readers. From this intensive interest and use of the Internet sprang his bold new project: The Experimental Witch where he invites his readers to adapt to the screen his book The Witch of Portobello. Indeed Paulo Coelho is a firm believer of Internet as a new media and is the first Best-selling author to actively support online free distribution of his work.",
      "rate": 8.6,
      "price": 18,
      "image": "The_Alchemist.jpg"
    }
  ],
  "liked_books": [
    {
      "_id": "601e81b9cc45272a0875c6d4",
      "name": "Antifragile: Things That Gain from Disorder",
      "author": "Nassim Nicholas Taleb",
      "genre": "Psychology",
      "publisher": "Random House",
      "date": "November 27th 2012",
      "summary": "From the bestselling author of The Black Swan and one of the foremost philosophers of our time, Nassim Nicholas Taleb, a book on how some systems actually benefit from disorder.\r\n\r\nIn The Black Swan Taleb outlined a problem; in Antifragile he offers a definitive solution: how to gain from disorder and chaos while being protected from fragilities and adverse events. For what he calls the \"antifragile\" is one step beyond robust, as it benefits from adversity, uncertainty and stressors, just as human bones get stronger when subjected to stress and tension.\r\n\r\nTaleb stands uncertainty on its head, making it desirable, and proposing that things be built in an antifragile manner. Extremely ambitious and multidisciplinary, Antifragile provides a blueprint for how to behave-and thrive-in a world we don't understand and which is too uncertain for us to even try to understand. He who is not antifragile will perish. Why is the city state better than the nation state, why is debt bad for you, and why is almost everything modern bound to fail? The book covers innovation, health, biology, medicine, life decisions, politics, foreign policy, urban planning, war, personal finance, and economic systems. Throughout, the voice and recipes of the ancient wisdom from Phoenician, Roman, Greek, and Medieval sources are heard loud and clear.",
      "about_author": "Nassim Nicholas Taleb spent 21 years as a risk taker (quantitative trader) before becoming a flaneur and researcher in philosophical, mathematical and (mostly) practical problems with probability. \r\n\r\nTaleb is the author of a multivolume essay, the Incerto (The Black Swan, Fooled by Randomness, Antifragile, and Skin in the Game) an investigation of opacity, luck, uncertainty, probability, human error, risk, and decision making when we don’t understand the world, expressed in the form of a personal essay with autobiographical sections, stories, parables, and philosophical, historical, and scientic discussions in nonover lapping volumes that can be accessed in any order.\r\n\r\nIn addition to his trader life, Taleb has also written, as a backup of the Incerto, more than 50 scholarly papers in statistical physics, statistics, philosophy, ethics, economics, international affairs, and quantitative finance, all around the notion of risk and probability.\r\n\r\nTaleb is currently Distinguished Professor of Risk Engineering at NYU's Tandon School of Engineering (only a quarter time position). His current focus is on the properties of systems that can handle disorder (\"antifragile\").\r\n\r\nTaleb believes that prizes, honorary degrees, awards, and ceremonialism debase knowledge by turning it into a spectator sport.",
      "rate": 7.8,
      "price": 25,
      "image": "Antifragile_Things_That_Gain_from_Disorder.jpg"
    }
  ],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c6"
  },
  "password": "$2b$10$kgahquHD93IjO0BEoBKWLuZSEsJRMR1qc5ToJGm21tYc4LrxoAZie",
  "username": "brook",
  "email": "brook@gmail.com",
  "date_joined": {
    "$date": "2020-11-18T21:04:51Z"
  },
  "age": 80,
  "country": "Germany",
  "confirmed": true,
  "ordered_books": [
    {
      "_id": "601e81b9cc45272a0875c6d4",
      "name": "Antifragile: Things That Gain from Disorder",
      "author": "Nassim Nicholas Taleb",
      "genre": "Psychology",
      "publisher": "Random House",
      "date": "November 27th 2012",
      "summary": "From the bestselling author of The Black Swan and one of the foremost philosophers of our time, Nassim Nicholas Taleb, a book on how some systems actually benefit from disorder.\r\n\r\nIn The Black Swan Taleb outlined a problem; in Antifragile he offers a definitive solution: how to gain from disorder and chaos while being protected from fragilities and adverse events. For what he calls the \"antifragile\" is one step beyond robust, as it benefits from adversity, uncertainty and stressors, just as human bones get stronger when subjected to stress and tension.\r\n\r\nTaleb stands uncertainty on its head, making it desirable, and proposing that things be built in an antifragile manner. Extremely ambitious and multidisciplinary, Antifragile provides a blueprint for how to behave-and thrive-in a world we don't understand and which is too uncertain for us to even try to understand. He who is not antifragile will perish. Why is the city state better than the nation state, why is debt bad for you, and why is almost everything modern bound to fail? The book covers innovation, health, biology, medicine, life decisions, politics, foreign policy, urban planning, war, personal finance, and economic systems. Throughout, the voice and recipes of the ancient wisdom from Phoenician, Roman, Greek, and Medieval sources are heard loud and clear.",
      "about_author": "Nassim Nicholas Taleb spent 21 years as a risk taker (quantitative trader) before becoming a flaneur and researcher in philosophical, mathematical and (mostly) practical problems with probability. \r\n\r\nTaleb is the author of a multivolume essay, the Incerto (The Black Swan, Fooled by Randomness, Antifragile, and Skin in the Game) an investigation of opacity, luck, uncertainty, probability, human error, risk, and decision making when we don’t understand the world, expressed in the form of a personal essay with autobiographical sections, stories, parables, and philosophical, historical, and scientic discussions in nonover lapping volumes that can be accessed in any order.\r\n\r\nIn addition to his trader life, Taleb has also written, as a backup of the Incerto, more than 50 scholarly papers in statistical physics, statistics, philosophy, ethics, economics, international affairs, and quantitative finance, all around the notion of risk and probability.\r\n\r\nTaleb is currently Distinguished Professor of Risk Engineering at NYU's Tandon School of Engineering (only a quarter time position). His current focus is on the properties of systems that can handle disorder (\"antifragile\").\r\n\r\nTaleb believes that prizes, honorary degrees, awards, and ceremonialism debase knowledge by turning it into a spectator sport.",
      "rate": 7.8,
      "price": 25,
      "image": "Antifragile_Things_That_Gain_from_Disorder.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6da",
      "name": "A Promised Land",
      "author": "Barack Obama",
      "genre": "Politics",
      "publisher": "Crown",
      "date": "November 17th 2020",
      "summary": "A riveting, deeply personal account of history in the making, from the president who inspired us to believe in the power of democracy.\r\n\r\nIn the stirring, highly anticipated first volume of his presidential memoirs, Barack Obama tells the story of his improbable odyssey from young man searching for his identity to leader of the free world, describing in strikingly personal detail both his political education and the landmark moments of the first term of his historic presidency—a time of dramatic transformation and turmoil.\r\n\r\nObama takes readers on a compelling journey from his earliest political aspirations to the pivotal Iowa caucus victory that demonstrated the power of grassroots activism to the watershed night of November 4, 2008, when he was elected 44th president of the United States, becoming the first African American to hold the nation’s highest office.\r\n\r\nReflecting on the presidency, he offers a unique and thoughtful exploration of both the awesome reach and the limits of presidential power, as well as singular insights into the dynamics of U.S. partisan politics and international diplomacy. Obama brings readers inside the Oval Office and the White House Situation Room, and to Moscow, Cairo, Beijing, and points beyond. We are privy to his thoughts as he assembles his cabinet, wrestles with a global financial crisis, takes the measure of Vladimir Putin, overcomes seemingly insurmountable odds to secure passage of the Affordable Care Act, clashes with generals about U.S. strategy in Afghanistan, tackles Wall Street reform, responds to the devastating Deepwater Horizon blowout, and authorizes Operation Neptune’s Spear, which leads to the death of Osama bin Laden.\r\n\r\nA Promised Land is extraordinarily intimate and introspective—the story of one man’s bet with history, the faith of a community organizer tested on the world stage. Obama is candid about the balancing act of running for office as a Black American, bearing the expectations of a generation buoyed by messages of “hope and change,” and meeting the moral challenges of high-stakes decision-making. He is frank about the forces that opposed him at home and abroad, open about how living in the White House affected his wife and daughters, and unafraid to reveal self-doubt and disappointment. Yet he never wavers from his belief that inside the great, ongoing American experiment, progress is always possible.\r\n\r\nThis beautifully written and powerful book captures Barack Obama’s conviction that democracy is not a gift from on high but something founded on empathy and common understanding and built together, day by day.",
      "about_author": "Barack Obama was the 44th president of the United States, elected in November 2008 and holding office for two terms. He is the author of two previous New York Times bestselling books, Dreams from My Father and The Audacity of Hope, and the recipient of the 2009 Nobel Peace Prize. He lives in Washington, D.C., with his wife, Michelle. They have two daughters, Malia and Sasha.",
      "rate": 6.6,
      "price": 33,
      "image": "A_Promised_Land.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6d6",
      "name": "Cracking the Coding Interview: 189 Programming Questions and Solutions",
      "author": "Gayle Laakmann McDowell",
      "genre": "Computer Science",
      "publisher": "CareerCup, LLC",
      "date": "February 10th 2016",
      "summary": "Cracking the Coding Interview: 189 Programming Questions and Solutions is a book by Gayle Laakmann McDowell about coding interviews.[1][2] It describes typical problems in computer science that are often asked during coding interviews, typically on a whiteboard during job interviews at big technology companies such as Google, Apple, Microsoft, Amazon.com, Facebook and Palantir Technologies.",
      "about_author": "Gayle Laakmann McDowell is the founder / CEO of CareerCup, and the author of Cracking the PM Interview, Cracking the Coding Interview, and Cracking the Tech Career.\r\n\r\nGayle has worked for Microsoft, Apple and Google as a software engineer. She holds a bachelor's and master's degree from the University of Pennsylvania in Computer Science, and an MBA from the Wharton School. She currently resides in Palo Alto, CA.",
      "rate": 8.7,
      "price": 12,
      "image": "Cracking_the_Coding_Interview_189_Programming_Questions_and_Solutions.jpg"
    }
  ],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c7"
  },
  "password": "$2b$10$nqMsPcnQQeadPkwdLtkGUecNmawIDHseqhkb05.UToSZ6MqlkRD62",
  "username": "nami",
  "email": "nami@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T19:18:02.535Z"
  },
  "age": 27,
  "country": "Spain",
  "confirmed": true,
  "ordered_books": [
    {
      "_id": "601e81b9cc45272a0875c6de",
      "name": "Attack on Titan",
      "author": "Hajime Isayama",
      "genre": "Manga",
      "publisher": "Kodansha Comics",
      "date": "June 19th 2012",
      "summary": "For the past century, what's left of mankind has hidden in a giant, three-walled city, trapped in fear of the bizarre, giant humanoids known as the Titans. Little is known about where they came from or why they are bent on consuming humankind, but the sudden appearance of an enormous Titan is about to change everything...",
      "about_author": "Hajime Isayama (諫山 創 Isayama Hajime, born 1986) is a Japanese manga artist from Ōyama, Ōita. His first and currently ongoing serial, Attack on Titan, has sold over 22 million copies as of July 2013. He has mentioned Tsutomu Nihei, Ryōji Minagawa, Kentaro Miura, Hideki Arai and Tōru Mitsumine as artists he respects, but stated that the manga that had the biggest influence on him was ARMS.",
      "rate": 9,
      "price": 10,
      "image": "Attack_on_Titan.jpg"
    }
  ],
  "liked_books": [
    {
      "_id": "601e81b9cc45272a0875c6d4",
      "name": "Antifragile: Things That Gain from Disorder",
      "author": "Nassim Nicholas Taleb",
      "genre": "Psychology",
      "publisher": "Random House",
      "date": "November 27th 2012",
      "summary": "From the bestselling author of The Black Swan and one of the foremost philosophers of our time, Nassim Nicholas Taleb, a book on how some systems actually benefit from disorder.\r\n\r\nIn The Black Swan Taleb outlined a problem; in Antifragile he offers a definitive solution: how to gain from disorder and chaos while being protected from fragilities and adverse events. For what he calls the \"antifragile\" is one step beyond robust, as it benefits from adversity, uncertainty and stressors, just as human bones get stronger when subjected to stress and tension.\r\n\r\nTaleb stands uncertainty on its head, making it desirable, and proposing that things be built in an antifragile manner. Extremely ambitious and multidisciplinary, Antifragile provides a blueprint for how to behave-and thrive-in a world we don't understand and which is too uncertain for us to even try to understand. He who is not antifragile will perish. Why is the city state better than the nation state, why is debt bad for you, and why is almost everything modern bound to fail? The book covers innovation, health, biology, medicine, life decisions, politics, foreign policy, urban planning, war, personal finance, and economic systems. Throughout, the voice and recipes of the ancient wisdom from Phoenician, Roman, Greek, and Medieval sources are heard loud and clear.",
      "about_author": "Nassim Nicholas Taleb spent 21 years as a risk taker (quantitative trader) before becoming a flaneur and researcher in philosophical, mathematical and (mostly) practical problems with probability. \r\n\r\nTaleb is the author of a multivolume essay, the Incerto (The Black Swan, Fooled by Randomness, Antifragile, and Skin in the Game) an investigation of opacity, luck, uncertainty, probability, human error, risk, and decision making when we don’t understand the world, expressed in the form of a personal essay with autobiographical sections, stories, parables, and philosophical, historical, and scientic discussions in nonover lapping volumes that can be accessed in any order.\r\n\r\nIn addition to his trader life, Taleb has also written, as a backup of the Incerto, more than 50 scholarly papers in statistical physics, statistics, philosophy, ethics, economics, international affairs, and quantitative finance, all around the notion of risk and probability.\r\n\r\nTaleb is currently Distinguished Professor of Risk Engineering at NYU's Tandon School of Engineering (only a quarter time position). His current focus is on the properties of systems that can handle disorder (\"antifragile\").\r\n\r\nTaleb believes that prizes, honorary degrees, awards, and ceremonialism debase knowledge by turning it into a spectator sport.",
      "rate": 7.8,
      "price": 25,
      "image": "Antifragile_Things_That_Gain_from_Disorder.jpg"
    }
  ],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c8"
  },
  "password": "$2b$10$9AFhV3s4ExgvtWUJFUR9Ye4Tq6I.0tLy9i..gFoCmUtlO84rWzDsO",
  "username": "robin",
  "email": "robin@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T20:32:48.810Z"
  },
  "age": 33,
  "country": "Italy",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6c9"
  },
  "password": "$2b$10$bx7ISkoJVqDKVP1YSizr/uKbUY.MENeSx762pqgnivNu90qwN/3xO",
  "username": "franky",
  "email": "franky@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T22:05:37.542Z"
  },
  "age": 30,
  "country": "USA",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6ca"
  },
  "password": "$2b$10$3qZhQ0Nq3WH2tklkiUpdeue3b8SxDm090psuE/pw.Zz3veLwT.YVK",
  "username": "chopper",
  "email": "chopper@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T22:07:42.246Z"
  },
  "age": 7,
  "country": "Canada",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6cb"
  },
  "password": "$2b$10$hdFO6AGZJjwTDEZO3uAbvu1Bh9ypDdFy/RJZefQ/FeQhOaFYkyoQq",
  "username": "ace",
  "email": "ace@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T22:26:40.536Z"
  },
  "age": 25,
  "country": "Japan",
  "confirmed": true,
  "ordered_books": [
    {
      "_id": "601e81b9cc45272a0875c6da",
      "name": "A Promised Land",
      "author": "Barack Obama",
      "genre": "Politics",
      "publisher": "Crown",
      "date": "November 17th 2020",
      "summary": "A riveting, deeply personal account of history in the making, from the president who inspired us to believe in the power of democracy.\r\n\r\nIn the stirring, highly anticipated first volume of his presidential memoirs, Barack Obama tells the story of his improbable odyssey from young man searching for his identity to leader of the free world, describing in strikingly personal detail both his political education and the landmark moments of the first term of his historic presidency—a time of dramatic transformation and turmoil.\r\n\r\nObama takes readers on a compelling journey from his earliest political aspirations to the pivotal Iowa caucus victory that demonstrated the power of grassroots activism to the watershed night of November 4, 2008, when he was elected 44th president of the United States, becoming the first African American to hold the nation’s highest office.\r\n\r\nReflecting on the presidency, he offers a unique and thoughtful exploration of both the awesome reach and the limits of presidential power, as well as singular insights into the dynamics of U.S. partisan politics and international diplomacy. Obama brings readers inside the Oval Office and the White House Situation Room, and to Moscow, Cairo, Beijing, and points beyond. We are privy to his thoughts as he assembles his cabinet, wrestles with a global financial crisis, takes the measure of Vladimir Putin, overcomes seemingly insurmountable odds to secure passage of the Affordable Care Act, clashes with generals about U.S. strategy in Afghanistan, tackles Wall Street reform, responds to the devastating Deepwater Horizon blowout, and authorizes Operation Neptune’s Spear, which leads to the death of Osama bin Laden.\r\n\r\nA Promised Land is extraordinarily intimate and introspective—the story of one man’s bet with history, the faith of a community organizer tested on the world stage. Obama is candid about the balancing act of running for office as a Black American, bearing the expectations of a generation buoyed by messages of “hope and change,” and meeting the moral challenges of high-stakes decision-making. He is frank about the forces that opposed him at home and abroad, open about how living in the White House affected his wife and daughters, and unafraid to reveal self-doubt and disappointment. Yet he never wavers from his belief that inside the great, ongoing American experiment, progress is always possible.\r\n\r\nThis beautifully written and powerful book captures Barack Obama’s conviction that democracy is not a gift from on high but something founded on empathy and common understanding and built together, day by day.",
      "about_author": "Barack Obama was the 44th president of the United States, elected in November 2008 and holding office for two terms. He is the author of two previous New York Times bestselling books, Dreams from My Father and The Audacity of Hope, and the recipient of the 2009 Nobel Peace Prize. He lives in Washington, D.C., with his wife, Michelle. They have two daughters, Malia and Sasha.",
      "rate": 6.6,
      "price": 33,
      "image": "A_Promised_Land.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6de",
      "name": "Attack on Titan",
      "author": "Hajime Isayama",
      "genre": "Manga",
      "publisher": "Kodansha Comics",
      "date": "June 19th 2012",
      "summary": "For the past century, what's left of mankind has hidden in a giant, three-walled city, trapped in fear of the bizarre, giant humanoids known as the Titans. Little is known about where they came from or why they are bent on consuming humankind, but the sudden appearance of an enormous Titan is about to change everything...",
      "about_author": "Hajime Isayama (諫山 創 Isayama Hajime, born 1986) is a Japanese manga artist from Ōyama, Ōita. His first and currently ongoing serial, Attack on Titan, has sold over 22 million copies as of July 2013. He has mentioned Tsutomu Nihei, Ryōji Minagawa, Kentaro Miura, Hideki Arai and Tōru Mitsumine as artists he respects, but stated that the manga that had the biggest influence on him was ARMS.",
      "rate": 9,
      "price": 10,
      "image": "Attack_on_Titan.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6e0",
      "name": "Parasyte",
      "author": "Hitoshi Iwaaki",
      "genre": "Manga",
      "publisher": "Del Rey",
      "date": "May 2007",
      "summary": "They arrive in silence and darkness. They descend from the skies. They have a hunger for human flesh. They are everywhere. They are parasites, alien creatures who must invade - and take control of - a human host to survive. And once they have infected their victims, they can assume any deadly form they choose: monsters with giant teeth, winged demons, creatures with blades for hands. But most have chosen to conceal their lethal purpose behind ordinary human faces. So no one knows their secret - except an ordinary high school student. Shin is battling for control of his own body against an alien parasite, but can he find a way to warn humanity of the horrors to come?",
      "about_author": "Hitoshi Iwaaki (Japanese: 岩明均 Hepburn: Iwaaki Hitoshi, born July 28, 1960) is a Japanese manga artist, whose works include the science-fiction/horror series Parasyte. The Mixx editions of Parasyte romanize his name as \"Hitosi Iwaaki\", while the Del Rey Manga editions use \"Hitoshi Iwaaki\".\r\n\r\nIn 1993, he received the Kodansha Manga Award for Parasyte. He was a finalist for the 2005 Tezuka Osamu Cultural Prize Grand Prize for Historie. In 2010 Historie took the grand prize in the manga division of the 2010 Japan Media Arts Festival.",
      "rate": 8.8,
      "price": 6,
      "image": "Parasyte.jpg"
    }
  ],
  "liked_books": [
    {
      "_id": "601e81b9cc45272a0875c6df",
      "name": "Thinking, Fast and Slow",
      "author": "Daniel Kahneman",
      "genre": "Psychology",
      "publisher": "Farrar, Straus and Giroux",
      "date": "October 25th 2011",
      "summary": "In the highly anticipated Thinking, Fast and Slow, Kahneman takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think. System 1 is fast, intuitive, and emotional; System 2 is slower, more deliberative, and more logical. Kahneman exposes the extraordinary capabilities—and also the faults and biases—of fast thinking, and reveals the pervasive influence of intuitive impressions on our thoughts and behavior. The impact of loss aversion and overconfidence on corporate strategies, the difficulties of predicting what will make us happy in the future, the challenges of properly framing risks at work and at home, the profound effect of cognitive biases on everything from playing the stock market to planning the next vacation—each of these can be understood only by knowing how the two systems work together to shape our judgments and decisions.\r\n\r\nEngaging the reader in a lively conversation about how we think, Kahneman reveals where we can and cannot trust our intuitions and how we can tap into the benefits of slow thinking. He offers practical and enlightening insights into how choices are made in both our business and our personal lives—and how we can use different techniques to guard against the mental glitches that often get us into trouble. Thinking, Fast and Slow will transform the way you think about thinking.",
      "about_author": "Daniel Kahneman (Hebrew: דניאל כהנמן‎ (born 5 March 1934) is an Israeli-American psychologist and winner of the 2002 Nobel Memorial Prize in Economic Sciences, notable for his work on behavioral finance and hedonic psychology.\r\n\r\nWith Amos Tversky and others, Kahneman established a cognitive basis for common human errors using heuristics and biases (Kahneman & Tversky, 1973, Kahneman, Slovic & Tversky, 1982), and developed Prospect theory (Kahneman & Tversky, 1979). He was awarded the 2002 Nobel Prize in Economics for his work in Prospect theory. Currently, he is professor emeritus of psychology at Princeton University's Department of Psychology.",
      "rate": 6.8,
      "price": 23,
      "image": "Thinking_Fast_and_Slow.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6de",
      "name": "Attack on Titan",
      "author": "Hajime Isayama",
      "genre": "Manga",
      "publisher": "Kodansha Comics",
      "date": "June 19th 2012",
      "summary": "For the past century, what's left of mankind has hidden in a giant, three-walled city, trapped in fear of the bizarre, giant humanoids known as the Titans. Little is known about where they came from or why they are bent on consuming humankind, but the sudden appearance of an enormous Titan is about to change everything...",
      "about_author": "Hajime Isayama (諫山 創 Isayama Hajime, born 1986) is a Japanese manga artist from Ōyama, Ōita. His first and currently ongoing serial, Attack on Titan, has sold over 22 million copies as of July 2013. He has mentioned Tsutomu Nihei, Ryōji Minagawa, Kentaro Miura, Hideki Arai and Tōru Mitsumine as artists he respects, but stated that the manga that had the biggest influence on him was ARMS.",
      "rate": 9,
      "price": 10,
      "image": "Attack_on_Titan.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6dc",
      "name": "Death Note",
      "author": "Tsugumi Ohba",
      "genre": "Manga",
      "publisher": "VIZ Media LLC",
      "date": "October 10th 2005",
      "summary": "Light Yagami is an ace student with great prospects - and he's bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami, a death god. Any human whose name is written in the notebook dies, and now Light has vowed to use the power of the Death Note to rid the world of evil. But when criminals begin dropping dead, the authorities send the legendary detective L to track down the killer. With L hot on his heels, will Light lose sight of his noble goal... or his life?\r\n\r\nBoredom\r\nLight tests the boundaries of the Death Note's powers as L and the police begin to close in. Luckily, Light's father is the head of the Japanese National Police Agency and leaves vital information about the case lying around the house. With access to his father's files, Light can keep one step ahead of the authorities. But who is the strange man following him, and how can Light guard against enemies whose names he doesn't know?",
      "about_author": "Tsugumi Ōba (Profile in Japanese: 大場 つぐみ), born in Tokyo, Japan, is a writer best known for the manga Death Note. His/her real identity is a closely guarded secret. As stated by the profile placed at the beginning of each Death Note manga, Ōba collects teacups and develops manga plots while holding his knees on a chair, similar to a habit of L, one of the main characters of the series.\r\n\r\nThere is speculation that Tsugumi Ōba is a pen name and that he is really Hiroshi Gamō. Pointing out that in Bakuman the main character's uncle was a one-hit wonder manga artist who worked on a gag super hero manga, very similar to Gamō and Tottemo! Luckyman in all aspects. Also that the storyboards drawn by Ōba greatly resemble Tottemo! Luckyman in style.",
      "rate": 9.4,
      "price": 7,
      "image": "Death_Note.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6d7",
      "name": "Rich Dad's CASHFLOW Quadrant: Rich Dad's Guide to Financial Freedom",
      "author": "Robert T. Kiyosaki",
      "genre": "Business",
      "publisher": "Plata Publishing",
      "date": "October 27th 2015",
      "summary": "Rich Dad’s CASHFLOW Quadrant is a guide to financial freedom. It’s the second book in the Rich Dad Series and reveals how some people work less, earn more, pay less in taxes, and learn to become financially free.\r\n\r\nCASHFLOW Quadrant was written for those who are ready to move beyond job security and enter the world of financial freedom. It’s for those who want to make significant changes in their lives and take control of their financial future.\r\n\r\nRobert believes that the reason most people struggle financially is because they've been spent years in school but were never been taught about money. Robert’s rich dad taught him that this lack of financial education is why so many people work so hard all their lives for money… instead of learning how to make money work for them.\r\n\r\nThis book will change the way you think about jobs, careers, and owning your own business and inspire you to learn the rules of money that the rich use to build and grow their wealth.",
      "about_author": "Kiyosaki is best known for his book Rich Dad, Poor Dad, the #1 New York Times bestseller. Kiyosaki followed with Rich Dad's CASHFLOW Quadrant and Rich Dad's Guide to Investing.",
      "rate": 6.9,
      "price": 14,
      "image": "Rich_Dads_CASHFLOW_Quadrant__Rich_Dads_Guide_to_Financial_Freedom.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6dd",
      "name": "Tokyo Ghoul",
      "author": "Sui Ishida",
      "genre": "Manga",
      "publisher": "Glénat",
      "date": "September 27th 2013",
      "summary": "In Tokyo, ghouls are rampant, cannibalistic monsters hiding among humans in order to feed themselves better. A shy student, Ken Kaneki is more interested in the pretty girl who shares his reading tastes than in these sordid affairs, until one day he is attacked by one of these famous creatures. Mortally wounded, he survives thanks to the transplant of his attacker's organs ... Recovering from his operation, he gradually realizes that he has become incapable of eating as before and begins to feel a suspicious appetite for his fellows. It is the beginning of a descent into hell for Kaneki, who has become a half-human, half-ghoul hybrid in spite of himself.",
      "about_author": "Sui Ishida (石田スイ, Ishida Sui), born December 28, Fukuoka Prefecture, Japan, is a Japanese manga artist\r\nIn 2010 he won the Young Jump 113th Grand Prix award with Tokyo Ghoul (東京喰種, Tōkyō Kushu). In March 2011, the same oneshot was published in the 2nd Issue of Miracle Jump. And later in September 2011, Tokyo Ghoul started as a series in Weekly Young Jump 2011-41 Issue. In December 2011, he made another oneshot about Rize that was published in December 2011 in Miracle Jump 6th Issue, which was later collected in the 6th volume of Tokyo Ghoul.\r\nIn 2013, he also started Tokyo Ghoul: Jack in the digital magazine Jump LIVE.\r\n\r\nSui Ishida is his penname; nobody knows his real name or what he looks like.",
      "rate": 8.7,
      "price": 9,
      "image": "Tokyo_Ghoul.jpg"
    }
  ],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6cc"
  },
  "password": "$2b$10$qclvomgMrzvusInpEFL4Xu6HsowHvLutj5.lnbfjzUEOrHxo0vTwq",
  "username": "sabo",
  "email": "sabo@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T22:29:15.273Z"
  },
  "age": 25,
  "country": "Japan",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6cd"
  },
  "password": "$2b$10$RAzkU38cc42iGcdd1LuVHOljfW6mS0Up95utvAT14Vevlv95q0Sgu",
  "username": "law",
  "email": "law@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T22:36:26.480Z"
  },
  "age": 24,
  "country": "Japan",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6ce"
  },
  "password": "$2b$10$lUVvhMMt62Te516HMZEnmekKbOwzkllJ3Nel5ZOG1EJ9i0FqadkgO",
  "username": "bigMom",
  "email": "big_mom@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T22:41:53.566Z"
  },
  "age": 52,
  "country": "China",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6cf"
  },
  "password": "$2b$10$Iix4xq2nVjEGGiqNeDGHxeOd0EMPXlr/sS0gEM1wXxMtLZddWSUHO",
  "username": "kaido",
  "email": "kaido@gmail.com",
  "date_joined": {
    "$date": "2020-11-23T22:44:33.254Z"
  },
  "age": 48,
  "country": "China",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "601e81b9cc45272a0875c6d0"
  },
  "password": "$2b$10$QggUdg4zBzVky28KNDHg0OEV2IwmH0PDSYk/YDqBBEfXZrGKS8mFG",
  "username": "shanks",
  "email": "shanks@gmail.com",
  "date_joined": {
    "$date": "2020-12-05T17:59:25.985Z"
  },
  "age": 37,
  "country": "Japan",
  "confirmed": true,
  "ordered_books": [],
  "liked_books": [],
  "isAdmin": false
},{
  "_id": {
    "$oid": "60a4369a7995085f445d6a12"
  },
  "confirmed": true,
  "ordered_books": [
    {
      "_id": "601e81b9cc45272a0875c6e0",
      "name": "Parasyte",
      "author": "Hitoshi Iwaaki",
      "genre": "Manga",
      "publisher": "Del Rey",
      "date": "May 2007",
      "summary": "They arrive in silence and darkness. They descend from the skies. They have a hunger for human flesh. They are everywhere. They are parasites, alien creatures who must invade - and take control of - a human host to survive. And once they have infected their victims, they can assume any deadly form they choose: monsters with giant teeth, winged demons, creatures with blades for hands. But most have chosen to conceal their lethal purpose behind ordinary human faces. So no one knows their secret - except an ordinary high school student. Shin is battling for control of his own body against an alien parasite, but can he find a way to warn humanity of the horrors to come?",
      "about_author": "Hitoshi Iwaaki (Japanese: 岩明均 Hepburn: Iwaaki Hitoshi, born July 28, 1960) is a Japanese manga artist, whose works include the science-fiction/horror series Parasyte. The Mixx editions of Parasyte romanize his name as \"Hitosi Iwaaki\", while the Del Rey Manga editions use \"Hitoshi Iwaaki\".\r\n\r\nIn 1993, he received the Kodansha Manga Award for Parasyte. He was a finalist for the 2005 Tezuka Osamu Cultural Prize Grand Prize for Historie. In 2010 Historie took the grand prize in the manga division of the 2010 Japan Media Arts Festival.",
      "rate": 8.8,
      "price": 6,
      "image": "Parasyte.jpg"
    }
  ],
  "liked_books": [
    {
      "_id": "601e81b9cc45272a0875c6d2",
      "name": "Confessions of an Economic Hitman",
      "author": "John Perkins",
      "genre": "Politics",
      "publisher": "Plume",
      "date": "2004",
      "summary": "John Perkins started and stopped writing Confessions of an Economic Hit Man four times over 20 years. He says he was threatened and bribed in an effort to kill the project, but after 9/11 he finally decided to go through with this expose of his former professional life. Perkins, a former chief economist at Boston strategic-consulting firm Chas. T. Main, says he was an \"economic hit man\" for 10 years, helping U.S. intelligence agencies and multinationals cajole and blackmail foreign leaders into serving U.S. foreign policy and awarding lucrative contracts to American business. \"Economic hit men (EHMs) are highly paid professionals who cheat countries around the globe out of trillions of dollars,\" Perkins writes. Confessions of an Economic Hit Man is an extraordinary and gripping tale of intrigue and dark machinations. Think John Le Carré, except it's a true story.\r\n\r\nPerkins writes that his economic projections cooked the books Enron-style to convince foreign governments to accept billions of dollars of loans from the World Bank and other institutions to build dams, airports, electric grids, and other infrastructure he knew they couldn't afford. The loans were given on condition that construction and engineering contracts went to U.S. companies. Often, the money would simply be transferred from one bank account in Washington, D.C., to another one in New York or San Francisco. The deals were smoothed over with bribes for foreign officials, but it was the taxpayers in the foreign countries who had to pay back the loans. When their governments couldn't do so, as was often the case, the U.S. or its henchmen at the World Bank or International Monetary Fund would step in and essentially place the country in trusteeship, dictating everything from its spending budget to security agreements and even its United Nations votes. It was, Perkins writes, a clever way for the U.S. to expand its \"empire\" at the expense of Third World citizens.",
      "about_author": "John Perkins is an activist and author. As a former chief economist at Boston strategic-consulting firm Chas. T. Main, Perkins says that he was an \"economic hit man\" for 10 years, helping U.S. intelligence agencies and multinational corporations cajole and blackmail foreign leaders into serving U.S. foreign policy and awarding lucrative contracts to American business.\r\n\r\nHowever, after several years struggling internally over the role he was playing in crippling foreign economies, he quit his consulting job. In the 1980s Perkins founded and directed a successful independent energy company, which he subsequently sold. Since then he has been heavily involved with non-profit organizations in Ecuador and around the world. He continues this work today, in addition to his writing. One of his organizations, Dream Change, is dedicated to shifting consciousness and promoting sustainable lifestyles for the individual and global community.\r\n\r\nHis new book, The New Confessions of an Economic Hit Man, a follow-up to best-seller Confessions of an Economic Hit Man, will be released in February 2016",
      "rate": 8.3,
      "price": 22,
      "image": "Confessions_of_an_Economic_Hitman.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6d4",
      "name": "Antifragile: Things That Gain from Disorder",
      "author": "Nassim Nicholas Taleb",
      "genre": "Psychology",
      "publisher": "Random House",
      "date": "November 27th 2012",
      "summary": "From the bestselling author of The Black Swan and one of the foremost philosophers of our time, Nassim Nicholas Taleb, a book on how some systems actually benefit from disorder.\r\n\r\nIn The Black Swan Taleb outlined a problem; in Antifragile he offers a definitive solution: how to gain from disorder and chaos while being protected from fragilities and adverse events. For what he calls the \"antifragile\" is one step beyond robust, as it benefits from adversity, uncertainty and stressors, just as human bones get stronger when subjected to stress and tension.\r\n\r\nTaleb stands uncertainty on its head, making it desirable, and proposing that things be built in an antifragile manner. Extremely ambitious and multidisciplinary, Antifragile provides a blueprint for how to behave-and thrive-in a world we don't understand and which is too uncertain for us to even try to understand. He who is not antifragile will perish. Why is the city state better than the nation state, why is debt bad for you, and why is almost everything modern bound to fail? The book covers innovation, health, biology, medicine, life decisions, politics, foreign policy, urban planning, war, personal finance, and economic systems. Throughout, the voice and recipes of the ancient wisdom from Phoenician, Roman, Greek, and Medieval sources are heard loud and clear.",
      "about_author": "Nassim Nicholas Taleb spent 21 years as a risk taker (quantitative trader) before becoming a flaneur and researcher in philosophical, mathematical and (mostly) practical problems with probability. \r\n\r\nTaleb is the author of a multivolume essay, the Incerto (The Black Swan, Fooled by Randomness, Antifragile, and Skin in the Game) an investigation of opacity, luck, uncertainty, probability, human error, risk, and decision making when we don’t understand the world, expressed in the form of a personal essay with autobiographical sections, stories, parables, and philosophical, historical, and scientic discussions in nonover lapping volumes that can be accessed in any order.\r\n\r\nIn addition to his trader life, Taleb has also written, as a backup of the Incerto, more than 50 scholarly papers in statistical physics, statistics, philosophy, ethics, economics, international affairs, and quantitative finance, all around the notion of risk and probability.\r\n\r\nTaleb is currently Distinguished Professor of Risk Engineering at NYU's Tandon School of Engineering (only a quarter time position). His current focus is on the properties of systems that can handle disorder (\"antifragile\").\r\n\r\nTaleb believes that prizes, honorary degrees, awards, and ceremonialism debase knowledge by turning it into a spectator sport.",
      "rate": 7.8,
      "price": 25,
      "image": "Antifragile_Things_That_Gain_from_Disorder.jpg"
    },
    {
      "_id": "601e81b9cc45272a0875c6dc",
      "name": "Death Note",
      "author": "Tsugumi Ohba",
      "genre": "Manga",
      "publisher": "VIZ Media LLC",
      "date": "October 10th 2005",
      "summary": "Light Yagami is an ace student with great prospects - and he's bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami, a death god. Any human whose name is written in the notebook dies, and now Light has vowed to use the power of the Death Note to rid the world of evil. But when criminals begin dropping dead, the authorities send the legendary detective L to track down the killer. With L hot on his heels, will Light lose sight of his noble goal... or his life?\r\n\r\nBoredom\r\nLight tests the boundaries of the Death Note's powers as L and the police begin to close in. Luckily, Light's father is the head of the Japanese National Police Agency and leaves vital information about the case lying around the house. With access to his father's files, Light can keep one step ahead of the authorities. But who is the strange man following him, and how can Light guard against enemies whose names he doesn't know?",
      "about_author": "Tsugumi Ōba (Profile in Japanese: 大場 つぐみ), born in Tokyo, Japan, is a writer best known for the manga Death Note. His/her real identity is a closely guarded secret. As stated by the profile placed at the beginning of each Death Note manga, Ōba collects teacups and develops manga plots while holding his knees on a chair, similar to a habit of L, one of the main characters of the series.\r\n\r\nThere is speculation that Tsugumi Ōba is a pen name and that he is really Hiroshi Gamō. Pointing out that in Bakuman the main character's uncle was a one-hit wonder manga artist who worked on a gag super hero manga, very similar to Gamō and Tottemo! Luckyman in all aspects. Also that the storyboards drawn by Ōba greatly resemble Tottemo! Luckyman in style.",
      "rate": 9.4,
      "price": 7,
      "image": "Death_Note.jpg"
    }
  ],
  "isAdmin": false,
  "username": "doflamingo",
  "email": "doflamingo@gmail.com",
  "password": "$2b$10$gsUW99Fb3s9eaf0ScGeVoOnJ30E/rnByX53FoG3Pu3cqTtX7gu64y",
  "age": 42,
  "country": "spain",
  "date_joined": {
    "$date": "2021-05-18T21:50:18.822Z"
  },
  "__v": 0
}]